[
    {
        "Number": 1,
        "Title": "Super-powered (Level 5)",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAawehyfcghysfdsDGDYdgdsfsdfwstdgdsgtert9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvQ0hJM004Wjk2TzRFLzIyYV8xNjA1MDM3MjMxXzEzNTU2MS5tcDQ=",
        "Description": "In the run-up to the Daihasei Sports Festival, Mikoto, along with other Level 5 espers, is approached with the offer of giving the athlete's pledge during the festival's opening ceremony. Meanwhile, when a fight breaks out between cheer squads over the use of the main stage, Kazari steps in to try and stop them. This attracts the attention of the seventh-ranked Level 5 esper, Gunha Sogiita, who ends up causing more harm than good with his Attack Crash ability. As Kazari and Ruiko try to save the civilians, Mikoto steps in to protect them from falling wreckage. In the end, as the offers are declined by Accelerator, Kakine, Mugino, and Mikoto, the representative roles are given to Gunha and Misaki, the latter of which shows an interest in the Sisters."
    },
    {
        "Number": 2,
        "Title": "The Daihasei Festival",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvVTRJU1pSM0oyNktMLzIyYV8xNjA1MDM4MDAzXzEzNTc1Ni5tcDQ=",
        "Description": "Following some explosive improv from Gunha, the Daihasei Festival begins with a three-legged race, with Mitsuko pairing up with Mikoto in place of the injured Kuroko. While Mikoto goes to change her outfit after winning her race, Misaka 10032 is mistaken for Mikoto and brought to take part in Tokiwadai's next event, Balloon Hunter, where someone has his sights set on her."
    },
    {
        "Number": 3,
        "Title": "Balloon Hunter",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyURASDGHUSRFSJGYfdsffsderFStewthsfSFtrftesdf9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvWE9ISUhQNVlCTVRGLzIyYV8xNjA1MDM2MjcwXzEzNTk2Mi5tcDQ=",
        "Description": "Tokiwadai begin the Balloon Hunter event against the opposing school, who gains an early lead due to intel on Tokiwadai's espers provided to them by a boy named Baba. Believing Misaka 10032 to be Mikoto, Baba sends his teammates to gang up on her while he sends a robotic mosquito to inject her with a nanodevice. After the event ends in Tokiwadai's defeat, Mikoto goes to have lunch with her mother Misuzu, having a run in with Touma and Misaki while getting drinks, while Ruiko and Kazari decide to search for a rumored metal known as Shadow Metal. Meanwhile, Misaka 10032 collapses from the nanodevice, at which point she is discovered by Misaki."
    },
    {
        "Number": 4,
        "Title": "Tampering",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvUkYyTktPU1FQWVAyLzIyYV8xNjA1MDM2MDcyXzEzNjEzMC5tcDQ=",
        "Description": "Mikoto rushes in to rescue Ruiko from some suited people as she searches one of the unused grounds for Shadow Metal, only to discover they were simply security officers doing their job. Meanwhile, Kazari uses her hacking skills to discover the site that Ruiko got the rumor about Shadow Metal from, keeping what she learned to herself. The next day, Mikoto discovers that Misaka 10032 has gone missing, learning that she was taken away by an ambulance whose drivers were being manipulated by Misaki. After failing to get any answers out of the drivers, Mikoto finds herself being placed under the guard of Misaki's clique before discovering that Kuroko, Ruiko, and Kazari have all had their memories of her stolen from them by Misaki."
    },
    {
        "Number": 5,
        "Title": "Trust",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdrefsdsdfwerFrefdsfrersfdsrfer363435349zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvM0hTUzVMWE5UUkQvMjJhXzE2MDUwMzc1MzhfMTM2MjU1Lm1wNA==",
        "Description": "Mitsuko, who was able to recognise Misaka 10032 as a different person, learns from Mikoto about Misaki's wrongdoings and decides to search for Misaka 10032 in her stead. Finding a cat at the scene of Misaka 10032's disappearance, Mitsuko learns that it belonged to the sister from Kinuho, who goes to fetch another esper who can help understand animals. This attracts the attention of Baba, who lures Mitsuko away and sends a group of robotic dogs to attack her. Baba manages to hit Mitsuko with a disabling nanodevice, but she is saved by the arrival of Kinuho and Maaya, who ask Ruiko to look after Mitsuko and the cat while they face off against Baba."

    },
    {
        "Number": 6,
        "Title": "The Battle Begins",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAawehyfcghysfdsDGDYdgdsfsdfwstdgdsgtert9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvUTNWVDFTRVdNV19PLzIyYV8xNjA1MDM1Nzg0XzEzNjU5MC5tcDQ=",
        "Description": "Baba uses the lure of the nanomachine, which could potentially be used to help Mitsuko, in order to split up Kinuho and Maaya. Meanwhile, Ruiko brings Mitsuko to the hospital, where Mikoto discovers her and angrily breaks away from Misaki's clique. Baba tries to overwhelm Kinuho by taking her away from water so she can't use her Hydro Hand ability, but she takes advantage of the water she carried through an underground drain in order to defeat him. He attempts to use the nanomachine mosquito against Kinuho but is thwarted by Maaya's ability to manipulate buoyancy. Baba runs off and brings out his most powerful robot, but it is easily destroyed by Mikoto, who threatens Baba to never approach her friends ever again."
    },
    {
        "Number": 7,
        "Title": "Auribus oculi fideliores sunt. (The eyes are more trustworthy than the ears)",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvVlNYNkQ2U0xEUE4vMjJhXzE2MDUwMzY4MzdfMTM3MTEzLm1wNA==",
        "Description": "With the help of an esper, Kinuho, Maaya, and Ruiko learn some of the circumstances of Misaka 10032's disappearance from the cat. Just as Mikoto receives this information from Ruiko, she is approached by a girl named Mitori Kouzaku, who has taken both Kazari and Misuzu hostage. As Kuroko arrives to help Mikoto rescue both hostages, they discover Mitori's partner is a mass of liquid metal controlled by her ability. After getting Kazari and Misuzu to safety, Ruiko explains that something Misaki mentioned in the cat's memories relates to the urban legend site she looked at before. Realizing that Kazari must've investigated it, Mikoto reconstructs the site's data, revealing information about Misaki."
    },
    {
        "Number": 8,
        "Title": "Railgun x Mental Out",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyURASDGHUSRFSJGYfdsffsderFStewthsfSFtrftesdf9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvTUtBNFFEUldCUTkvMjJhXzE2MDUwMzYwMjFfMTM3ODE5Lm1wNA==",
        "Description": "Mikoto tracks down Misaki, who reveals she had hid Misaka 10032 to keep her safe from the group pursuing the Sisters in order to access the Misaka Network. She further reveals that the man behind it is Gensei Kihara, who was the advocate for the Level 6 Shift project. As the two of them head towards a conference building, where Gensei awaits, Kuroko, Kazari, and Ruiko look into Mitori."
    },
    {
        "Number": 9,
        "Title": "Kozaku Mitori",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAawehyfcghysfdsDGDYdgdsfsdfwstdgdsgtert9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvMTVRTDlGMTk1T1BQLzIyYV8xNjA1MDM1NjY3XzEzNzk3Ny5tcDQ=",
        "Description": "While Mikoto and Misaki take their own approaches to infiltrating Gensei's headquarters, Kuroko and Kazari head to the Bank Control Center to find more information on Mitori, finding her records claim that she's dead. Meanwhile, Ruiko lends her good luck charm to Touma for a scavenger hunt, after which she spots an abandoned factory that once produced the liquid metal Mitori controlled, finding it is still in use. Ruiko is caught by Mitori's metal clone but is rescued by MEMBER affiliate Xochitl, who realised Mitori had been using her and Baba. Mikoto and Misaki allegedly find Gensei, only to discover it to be a decoy in disguise to distract them while forces are sent to attack the building where Misaka 10032 is being kept."
    },
    {
        "Number": 10,
        "Title": "Clone Dolly",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyURASDGHUSRFSJGYfdsffsderFStewthsfSFtrftesdf9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvOE9SNDJVUDRCMjQvMjJhXzE2MDUwMzUwMThfMTM4MzEyLm1wNA==",
        "Description": "As Misaki is forced to use a power booster called Exterior to push her abilities to the limits and get through a traffic jam, she recalls her time in a training facility. Here, she was asked by scientists to use her powers to have a clone named Dolly recognise her as her friend Mi. After Dolly suddenly died, Misaki learned that the scientists were planning to use the Exterior Project to allow anyone to use Mental Out, leading her to brainwash the entire personnel to keep it under control. As Mikoto and Misaki arrive at the facility, where it is revealed Exterior is formed from a piece of Misaki's brain, Gensei manages to attune his waves to Exterior in order to undo the protection on Misaka 10032 and plant a virus into the Misaka Network. It is then that Gensei commences his true experiment, using the energy formed from the virus to forcibly attempt to turn Mikoto into a Level 6 Esper."
    },
    {
        "Number": 11,
        "Title": "Joining the Battle",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2FscGluZS1mcmVlZG9tLTI5MjAxOS85RjRQWlBIUFhHUi9zdDIzX3RvYXJ1LWthZ2FrdS1uby1yYWlsZ3VuLXQtZXBpc29kZS0xMS4xNjA1MDAwNzU2Lm1wNA==",
        "Description": "Touma, having learned about the situation from Xochitl, is given instructions from Misaki on how to deal with Mikoto, who is manipulated by Mitori's usage of Misaki's powers into attacking the governing board building. After Kuroko arrives and gets Misaka 10032 to safety, she is tasked with finding Mitori in order to stop her control on Mikoto, facing up against her metal puppet along the way. As Gunha arrives on the scene to assist Touma in stopping Mikoto, Misaki goes to confront Gensei himself."
    },
    {
        "Number": 12,
        "Title": "Exterior",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdrefsdsdfwerFrefdsfrersfdsrfer363435349zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2FscGluZS1mcmVlZG9tLTI5MjAxOS83MTI3X1VDOUFMVS9zdDIzX3RvYXJ1LWthZ2FrdS1uby1yYWlsZ3VuLXQtZXBpc29kZS0xMi4xNjA0OTg5NzE2Lm1wNA==",
        "Description": "Realising Gensei is trying to obtain the limiter unlock code for Exterior from her to control Mikoto further, Misaki attempts to trap him only to discover he possesses Multiskill, allowing him to us multiple abilities. Meanwhile, Kuroko begins to close in on Mitori, facing tougher opposition from the puppet. Misaki sets up a multi-phase trap to try and stop Gensei, but he manages to see through every step, ultimately managing to get past Misaki's mental defenses and obtain the code."
    },
    {
        "Number": 13,
        "Title": "SYSTEM (Those Who Arrive at Heaven's Will in an Only Human Body)",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyURASDGHUSRFSJGYfdsffsderFStewthsfSFtrftesdf9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvMkdRMUZKREVaUzRLLzIyYV8xNjA1MDM1Mzk0XzEzOTEwMy5tcDQ=",
        "Description": "After Kazari discovers that Mitori had hijacked an Antiskill camera drone to help control her doppelganger, she hijacks the camera herself to fake Kuroko's death, allowing the real Kuroko to find Mitori hiding in the sewers and take her down. Meanwhile, Gensei discovers too late that the input code he got from Misaki was actually Exterior's self-destruct code, which Misaki had tricked him into using by rewriting her own memory. With Exterior destroyed, Mikoto regains her senses but is still unable to stop her power from going out of control."
    },
    {
        "Number": 14,
        "Title": "Dragon Strike (Jaw of the Dragon King)",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAawehyfcghysfdsDGDYdgdsfsdfwstdgdsgtert9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvVzdETkdEQjVfTkw2L3N0MjJfdG9hcnUta2FnYWt1LW5vLXJhaWxndW4tdC1lcGlzb2RlLTE0LjE2MDUwMzY2NzIubXA0",
        "Description": "Working along Gunha, Touma uses the power which lies beyond Imagine Breaker, finally stopping Mikoto's rampage and returning her to normal. Afterwards, Mikoto goes to visit Mitsuko, who feels happy upon hearing that Kinuho and Maaya came to her aid. After restoring the memories of Kuroko and the others, while rewriting others pertaining to the whole incident to appear like a terrorist attack, Misaki approaches Mitori. As the Daihasei Festival comes to a close without further incident, Ruiko arranges for Mikoto to dance with Touma."
    },
    {
        "Number": 15,
        "Title": "Promise",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdrefsdsdfwerFrefdsfrersfdsrfer363435349zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2FscGluZS1mcmVlZG9tLTI5MjAxOS9DXzJFODk0MjJBNUQvMjNhXzE2MDQ5NzY0NzFfMTQwMTEzLm1wNA==",
        "Description": "Mitori recalls her time in a facility where she ended up being befriended by Dolly, prior to her meeting with Misaki. After discovering that Dolly was a clone that was being fed experimental drugs, she was caught and confined for several months, leading to a building hatred towards the governing board. Back in the present, Misaki brings Mitori to meet Dolly's \"little sister\" that has inherited her memories, leading to a touching reunion between the three of them."
    },
    {
        "Number": 16,
        "Title": "Dream Ranker",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAawehyfcghysfdsDGDYdgdsfsdfwstdgdsgtert9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvNTg2VjhMOTZMS1UyLzIyYV8xNjA1MDMyMjAzXzE0MjcwMC5tcDQ=",
        "Description": "Junko Hokaze, a member of Misaki's clique, gives Mikoto an Indian Poker card that allegedly lets people experience other people's dreams. Trying out the card for herself, Mikoto experiences Junko's dream, which turns out to be less pleasant than she originally expected. The next day, Junko tries holding a tea party to help Mikoto and Misaki get along, but they become angered after overhearing a certain blue-haired boy giving out cards based on his dubious fantasies of them. Meanwhile, Kuroko and Kazari look into an app that allegedly shows the location of accidents before they happen. Scouting out the location of one of these future accidents, Kuroko saves someone from a traffic accident at that very location. Kuroko then confronts a precognative esper boy named Shaei Miyama, who states that he created the app so he could find an esper that can prevent these accidents from happening."
    },
    {
        "Number": 17,
        "Title": "Precognition",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdrefsdsdfwerFrefdsfrersfdsrfer363435349zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2FscGluZS1mcmVlZG9tLTI5MjAxOS9fNDY5NzY2OEs4UFcvc3QyM190b2FydS1rYWdha3Utbm8tcmFpbGd1bi10LWVwaXNvZGUtMTcuMTYwNDk3OTc5OS5tcDQ=",
        "Description": "Working together, Kuroko manages to use her teleportation to prevent more accidents predicted by Shaei's precognitions. As Judgment takes countermeasures to prevent multiple potential accidents predicted to happen in close proximity with each other at the park, Shaei collapses as a result of overusing his ability. At the predicted time, cherry blossom trees suddenly set ablaze, which Kuroko deduces is due to a chemical that was injected into them to bloom all-year round. As Kuroko works to save civilians, Shaei desperately asks Kuroko to save a stray dog named Perro, which she manages to do. After learning that the ones who created the chemical learned it from Indian Poker, Kuroko encourages Shaei to approach her again once he has better control of his ability."
    },
    {
        "Number": 18,
        "Title": "Bust Upper",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2FscGluZS1mcmVlZG9tLTI5MjAxOS85V181UTVMQUxKOTgvc3QyM190b2FydS1rYWdha3Utbm8tcmFpbGd1bi10LWVwaXNvZGUtMTguMTYwNDk3ODA5Ni5tcDQ=",
        "Description": "Coming across an Indian Poker trader on the street, Saiai Kinuhata, one of ITEM's members with a complex about her figure, fights with Mikoto over a card relating to something called the \"Bust Upper\". After their fight causes all the cards to become mixed up, Mikoto and Saiai, realising they have the same goal, purchase all the cards and try them out one by one in search of the Bust Upper. Despite trying out all the cards, including one that gives Mikoto a rather forboding dream, the pair are unable to find the Bust Upper, as it is stolen by a crow during their sleep and falls into the hands of another girl."
    },
    {
        "Number": 19,
        "Title": "Strange Coincidence",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2FscGluZS1mcmVlZG9tLTI5MjAxOS9XTVhXNFJfTDRRQkovc3QyM190b2FydS1rYWdha3Utbm8tcmFpbGd1bi10LWVwaXNvZGUtMTkuMTYwNDk3OTA3MC5tcDQ=",
        "Description": "After Ruiko ends up buying the last cans of mackerel she wanted to buy, Frenda tries to get some off of her and ends up having dinner with her, leading the two of them to become friends. Some time later, as Ruiko buys herself another Indian Polka card, a group called SCHOOL looking for a card pertaining to something called \"the tweezers\" arrange for her to be kidnapped, prompting Frenda to go and rescue her. After the kidnap attempt is foiled, SCHOOL calls upon the sniper Rakko Yumiya to hunt down Ruiko and Frenda."
    },
    {
        "Number": 20,
        "Title": "Ha det bra",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdrefsdsdfwerFrefdsfrersfdsrfer363435349zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvOURXOTFZN1A3U0U1LzIyYV8xNjA1MDMxNDYyXzE0NDAwMi5tcDQ=",
        "Description": "Despite dealing multiple shots to Frenda as she pursues them into a shopping mall, Yumiya falls for a trap by Frenda and Ruiko, exposing herself as their pursuer. While Ruiko escapes with the other customers, Frenda faces off against Yumiya in a one-on-one duel, winning against her using her bombs. As SCHOOL, led by the 2nd ranked Level 5 esper Teitoku Kakine, plan their next move regarding the tweezers, Ruiko never hears from Frenda again."
    },
    {
        "Number": 21,
        "Title": "Doppelganger",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdrefsdsdfwerFrefdsfrersfdsrfer363435349zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2FscGluZS1mcmVlZG9tLTI5MjAxOS9VUDlXWV9XN1A5US8yM2FfMTYwNDk3MzE1OV8xNDQ0MDEubXA0",
        "Description": "Misaki looks into Ryoko Kuriba, who allegedly came up with the plans for Indian Poker. She learns that Ryoko was part of her experiment to use cyborg technology to turn her into two people before being rejoined to determine if a soul could be created. As Mikoto is sent by Misaki to investigate the results of the experiments, the cyborg Doppelganger of Ryoko left after the experiment, who believed herself to be human, experiences an identity crisis and breaks out of her facility. Mikoto and Misaki then confront the original Ryoko about the threat Doppelganger poses, while another underground group known as Scavenger is dispatched to hunt down Doppelganger."
    },
    {
        "Number": 22,
        "Title": "Scavenger",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvTE41RFU2MldJU0M2LzIyYV8xNjA1MDUyNzYzMTQ0NzkwLm1wNA==",
        "Description": "Ryoko states that she believes destroying Dopperlganger's body could cause calamity to befall Academy City, leading her to invent Indian Poker as a means to crowdsource a solution. Later on, Ryoko is confronted by Doppelganger, before Scavenger show up to try and detain Doppelganger. As the other members struggle again Doppelganger's power, Ryoko is pursued by Seike Taroumaru but is rescued by Mikoto after she learns that Ryoko created Doppelganger as a means to save her mother. Upon receiving heavy damage to her body, Doppelganger begins to absorb other forms of matter to repair herself and become more powerful, at which point Mikoto, having just defeated Seike, confronts the other Scavenger members."
    },
    {
        "Number": 23,
        "Title": "Possession",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvUVQ0Q19LTFlLTzIzLzIyYV8xNjA1MjQxNzExXzE0NTEzMy5tcDQ=",
        "Description": "Wanting to avoid a fight, Scavenger leader Rita Iizumi somehow manages to convince Mikoto that she's a member of Judgment sent to recover Doppelganger. While Mikoto pursues Doppelganger, who is targeting an airship filled with secret information, Rita guides them towards the facility the Scavengers were supposed to deliver Doppelganger to so they can sign off their job and escape. Facing off against Mikoto, Dopperlganger continues to absorb more matter to grow to an enormous size."
    },
    {
        "Number": 24,
        "Title": "Diffusion",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdeqwrwedffryretgsdFrsftrsvfsfsr9zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvQ0MySVo2RkZaXzRKLzIyYV8xNjA1MDQ3OTY3MTQ1NTIzLm1wNA==",
        "Description": "Mikoto uses her ability to create her own giant out of iron sand, using its properties to fire off a powerful electrical that can cut through Dopperlganger's body. Doppelganger responds by forcing Mikoto to shoot down fuel tanks to protect civilians, exposing the airship in the process. As Ryoko tries to reason with Doppelganger to let her find a way to eliminate her own soul, she attempts to jump to her death but is saved by the Scavengers. Learning from Misaki and Rita that Doppelganger's ability is actually a form of artificial muscle, which Doppelganger intends to use to set off a citywide explosion, Mikoto confronts Ryoko aboard the airship with Rita's assistance."
    },
    {
        "Number": 25,
        "Title": "My Dear Friends",
        "Link": "https://gogo-stream.com/goto.php?url=aHR0cHM6LyAdrefsdsdfwerFrefdsfrersfdsrfer363435349zdG9yYWdlLmdvb2dsZWFwaXMuY29tL2hlcm9pYy1kaW9kZS0yOTIwMTkvWVBHUzJJUFQ3XzMvc3QyMl90b2FydS1rYWdha3Utbm8tcmFpbGd1bi10LWVwaXNvZGUtMjUuMTYwNTI0MjI4NC5tcDQ=",
        "Description": "Learning that Doppelganger's objective was to end her life and destroy the data that could rebuild her, Mikoto respects her wishes and destroys the airship. Before Mikoto can finish off Doppelganger, one of the scientists attempts to take Ryoko hostage to stop her, accidentally shooting her in the process. In her final moments, Doppelganger asks Mikoto to use what's left of her cyborg body to save Ryoko. Later, the Scavengers increase their rank in exchange for not getting paid for their mission while Mitsuko is formally introduced to Misaka 10032. Meanwhile, Doppelganger appears in Ryoko's dream, suggesting that she now coexists inside her body."
    }
]